import prompt

def earth_to_sun():
    prompt.bot_say("Середня відстань між Землею та Сонцем становить близько 149,6 мільйонів кілометрів або 1 астрономічна одиниця (АО)")

def stars():
    prompt.bot_say("У астрономії відомо багато типів зір, але основні класифікації включають наступні типи: \nМалі червоні карлики \nЖовті карлики \nГіганти \nСупергіганти \nНейтронні зірки \nЧорні діри")

def what_astronomy
    prompt.bot_say("Астрономія - це наука, яка вивчає небесні об'єкти та явища в космосі, такі як зірки, планети, галактики, космічні тіла та інші об'єкти, а також їхню фізичну природу, властивості та рухи")

def comets():
    prompt.bot_say("Комети - це невеликі космічні тіла, що складаються переважно зо льоду, пилу та газу")