import prompt

def diff_noun_adj():
    prompt.bot_say("Іменник і прикметник - це два різних типи слів у мові, які виконують різні функції. \nІменник - це слово, що позначає назву людини, місця, речі або ідеї. \nПрикметник - це слово, яке описує іменник, надаючи йому додаткову інформацію про його властивості або стан")

def ukr_cases():
    prompt.bot_say("В українській мові налічують сім відмінків: називний, родовий, давальний, знахідний, орудний, місцевий і кличний")

def what_philology():
    prompt.bot_say("Філологія — сукупність гуманітарних наук: мовознавства, літературознавства, фольклористики, текстології, джерелознавства, риторики, палеографії тощо, які вивчають духовну культуру певного народу чи цивілізації через мовний і стилістичний аналіз літературних та інших пам'яток")

def branches_philology():
    prompt.bot_say("Філологія включає в себе галузі науки, такі як лінгвістика, літературознавство, фольклористика, культурологія, комунікації та інші")